{
  "main": {
    "name":"Shashi Bhushan",
    "description":"I am a software development engineer who loves problem solving and data structures. I use Java, Spring, REST APIs, Springboot, python, cloud technologies, react, angular and other javascript based frameworks to develop apps, services. Continuos learning and growth is something i strive for. This is my portfolio project which can be used as resume",
    "image":"profilepic.jpg",
    "bio":"Hands on Java Developer & AWS Certified Solutions Architect ( Core Java, REST/SOAP Web-services, Multi-threading, JPA, ORM, Spring-boot and other frameworks) with experience of designing and building highly scalable and fault tolerant APIs in a distributed systems on a cloud infrastructure (AWS or Azure). Very much comfortable with PL/SQL. With the world moving towards automation, AI , IOT etc, I really fantasize the charm these buzz words have brought into this Industry and the way it has opened up a plethora of innovation opportunities. My curiosity in this field makes me a \"Beginner in Machine Learning and Big Data\".",
    "contactmessage":"Here is where you should write your message to Guru Dev to have him get in contact with you.",
    "email": "findshashihere@gmail.com",
    "phone": "814-881-9296",
    "github":"https://github.com/shashi6786/heygurudev",
    "project":"https://github.com/shashi6786/heygurudev",
    "address":{
      "street":"24693 Ravine Cir",
      "city":"Farmington Hills",
      "state":"Michigan",
      "zip": "48335"
    },
    "website": "https://www.linkedin.com/in/findshashihere/",
    "resumedownload":"https://www.linkedin.com/in/findshashihere/",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/findshashihere",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"https://twitter.com/shashisastra",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/findshashihere/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/sassyshashi/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/shashi6786/",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Here you can create a short write-up of your skills to show off to employers",
    "education":[
      {
        "school":"SASTRA University",
        "degree":"Bachelor of Technology (B.Tech.) in Computer Science Engineering",
        "graduated":"May 2011",
        "batch":"2007-2011",
        "description":""
      },
      {
        "school":"Patna Science College",
        "degree":"Senior Secondary (+2) in Mathematics & Science as major",
        "graduated":"March 2007",
        "batch":"2005-2007",
        "description":""
      }
    ],
    "work":[
      {
        "company":"Systems Technology Group, Inc. (STG)",
        "title":"Software Developer Technical Lead",
        "techstack": "Java, PCF, Spring, Springboot, JPA, JUnit, Mockito, TDD, Agile, Pair Programming, Zuora, Azure, AWS, Python, React, Angular, AEM, Rally, JIRA, Splunk, Dynatrace",
        "years":"July 2019 - Present",
        "description":"Client - Ford Motor Company is going through a digital transformation. Ford's Subscription Services Platform is the global and integrated set of subscription & payment capabilities designed to support Ford’s mobility and digital service offerings. The platform seeks to ensure consistent, intuitive subscription management experiences across all channels and regions where mobility products are sold. As a Software Developer Technical Lead, I help the team in achieving these targets by building microservices to manage end to end subscription offering, creation, payment, renewal, cancellation, refund etc., which are made available to the customers (vehicle owners) across EU21 countries, USA, Mexico, China, Australia etc. for various products (ex: Live Traffic, Connected Vehicle Navigation, Plug & Charge) through a product catalog. These features are activated on those vehicles Over the Air by provisioning the actual feature through Modem present on vehicle. I also provide stakeholders with reporting key insights and business value metrics generated to drive evidence-based decision making."
      },
      {
        "company":"Tata Consultancy Services",
        "title":"Senior Java Developer",
        "techstack": "Java, AWS, Predix, Spring, Springboot, JPA, Scalr, JUnit, TDD, Agile, Oracle, PL/SQL, Solr, Zookeeper, Angular, CSS, Javascript ES6, Jasmine, Mockito, Rally, JIRA, AppDynamics, NewRelic, Splunk",
        "years":"Sep 2011 - July 2019",
        "description":"Client - GE Transportation, a Wabtec Company. Wabtec sells locomotive to customers like BNSF Railways, Indian Railways etc. eServices is a one stop solution to all shop floor management activities and keeps all contract details. As a part of this platform team, I created microservices which were consumed by B2C/B2B customers for handling the complete life cycle of a locomotive . The application also handles hassle of daily service repair and floor activities, like CRUD operation on \"tasks\", \"materials\",\"accounts\",\"reporting\" etc. I also worked with customer to do infrastructure migration to AWS cloud as well as the real-time integration on the inbound and outbound processes. Also, initiated a lot of digital transformation in team."
      }
    ],
    "skills":[
      {
        "name":"Java",
        "level":"100%"
      },
      {
        "name":"Springboot",
        "level":"90%"
      },
      {
        "name":"Microservices",
        "level":"90%"
      },
      {
        "name":"Spring",
        "level":"90%"
      },
      {
        "name":"REST APIs",
        "level":"90%"
      },
      {
        "name":"Distributed Systems",
        "level":"80%"
      },
      {
        "name":"Cloud Architecture",
        "level":"70%"
      },
      {
        "name":"Front end (JS, React, Angular)",
        "level":"40%"
      }
    ]
  },
  "portfolio":{
    "projects": [
    ]
  },
  "certification":{
    "skillmessage":"Here you can create a short write-up of your industry certifications to show off to employers",
    "certificates":[
      {
        "name":"AWS Certified Solutions Architect - Associate",
        "issuing_organization":"Amazon Web Services (AWS)",
        "issue_date":"May 2019",
        "credential_id":"GQQEZN5CLBR11K51",
        "credential_url":"http://aws.amazon.com/verification"
      },
      {
        "name":"Certified Python Programmer - Associate",
        "issuing_organization":"Python Institute",
        "issue_date":"Apr 2020",
        "credential_id":"",
        "credential_url":"https://www.youracclaim.com/badges/76192ffa-f614-4504-913f-aaf27a9c4905/linked_in_profile"
      },
      {
        "name":"Certified Advanced Google Analytics - Associate",
        "issuing_organization":"Google",
        "issue_date":"Apr 2020",
        "credential_id":"",
        "credential_url":"https://skillshop.exceedlms.com/student/award/49462575"
      },
      {
        "name":"Oracle Cloud Infrastructure Certified - Associate",
        "issuing_organization":"Oracle",
        "issue_date":"May 2020",
        "credential_id":"",
        "credential_url":"https://www.youracclaim.com/badges/ca731a18-318d-420e-9680-d2092071700e/linked_in_profile"
      }
    ],
    "work":[
      {
        "company":"Systems Technology Group, Inc. (STG)",
        "title":"Software Developer Technical Lead",
        "years":"July 2019 - Present",
        "description":"Ford Motor Company is going through a digital transformation and building subscription-based services REST APIs which are made available to the customers (vehicle owners) across world for various products (ex: Live Traffic, Smart Charge, Plug & Charge) through a product catalog. The catalogs are unique for each country based of what type of vehicles are launched in those regions. These features & subscriptions need to be activated on those vehicles Over the Air instantly by provisioning the actual feature through Modem present on vehicle. Handling payment for the subscriptions through Ford-Pay wallet."
      },
      {
        "company":"Tata Consultancy Services",
        "title":"Senior Java Developer",
        "years":"Sep 2011 - July 2019",
        "description":"GE Transportation, a Wabtec Company - building the software on Predix platform (cloud-based Platform-as-a-Service (PaaS) for the Industrial Internet). Converted a monolithic application into microservices to lead the digital transformation. Building and maintaining the “e-Services”, a web application with monolithic architecture using JSP, Servlets, Spring 2 and Java 6 to serve users across globe with various services related to locomotive management and handling hassle of daily service repair floor activities. I worked with customer to do infrastructure migration as well as the real-time integration on the inbound and outbound process. Also, initiated a lot of digital transformation in team."
      }
    ],
    "skills":[
      {
        "name":"Java",
        "level":"100%"
      },
      {
        "name":"Springboot",
        "level":"90%"
      },
      {
        "name":"Microservices",
        "level":"90%"
      },
      {
        "name":"Spring",
        "level":"90%"
      },
      {
        "name":"REST APIs",
        "level":"90%"
      },
      {
        "name":"Distributed Systems",
        "level":"80%"
      },
      {
        "name":"Cloud Architecture",
        "level":"70%"
      },
      {
        "name":"Front end (JS, React, Angular)",
        "level":"40%"
      }
    ]
  }
}
